espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/pvt_reg.h
/** PVT_COMB_PD_SITE3_UNIT1_VT1_CONF2_REG register
 *  needs desc
 */
#define PVT_COMB_PD_SITE3_UNIT1_VT1_CONF2_REG (DR_REG_PVT_BASE + 0x1cc)
/** PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT1 : R/W; bitpos: [1:0]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT1    0x00000003U
#define PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT1_M  (PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT1_V << PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT1_S)
#define PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT1_V  0x00000003U
#define PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT1_S  0
/** PVT_DELAY_OVF_VT1_PD_SITE3_UNIT1 : RO; bitpos: [15]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_OVF_VT1_PD_SITE3_UNIT1    (BIT(15))
#define PVT_DELAY_OVF_VT1_PD_SITE3_UNIT1_M  (PVT_DELAY_OVF_VT1_PD_SITE3_UNIT1_V << PVT_DELAY_OVF_VT1_PD_SITE3_UNIT1_S)
#define PVT_DELAY_OVF_VT1_PD_SITE3_UNIT1_V  0x00000001U
#define PVT_DELAY_OVF_VT1_PD_SITE3_UNIT1_S  15
/** PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT1 : RO; bitpos: [31:16]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT1    0x0000FFFFU
#define PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT1_M  (PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT1_V << PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT1_S)
#define PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT1_V  0x0000FFFFU
#define PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT1_S  16

/** PVT_COMB_PD_SITE3_UNIT2_VT1_CONF2_REG register
 *  needs desc
 */
#define PVT_COMB_PD_SITE3_UNIT2_VT1_CONF2_REG (DR_REG_PVT_BASE + 0x1d0)
/** PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT2 : R/W; bitpos: [1:0]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT2    0x00000003U
#define PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT2_M  (PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT2_V << PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT2_S)
#define PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT2_V  0x00000003U
#define PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT2_S  0
/** PVT_DELAY_OVF_VT1_PD_SITE3_UNIT2 : RO; bitpos: [15]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_OVF_VT1_PD_SITE3_UNIT2    (BIT(15))
#define PVT_DELAY_OVF_VT1_PD_SITE3_UNIT2_M  (PVT_DELAY_OVF_VT1_PD_SITE3_UNIT2_V << PVT_DELAY_OVF_VT1_PD_SITE3_UNIT2_S)
#define PVT_DELAY_OVF_VT1_PD_SITE3_UNIT2_V  0x00000001U
#define PVT_DELAY_OVF_VT1_PD_SITE3_UNIT2_S  15
/** PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT2 : RO; bitpos: [31:16]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT2    0x0000FFFFU
#define PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT2_M  (PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT2_V << PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT2_S)
#define PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT2_V  0x0000FFFFU
#define PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT2_S  16

/** PVT_COMB_PD_SITE3_UNIT3_VT1_CONF2_REG register
 *  needs desc
 */
#define PVT_COMB_PD_SITE3_UNIT3_VT1_CONF2_REG (DR_REG_PVT_BASE + 0x1d4)
/** PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT3 : R/W; bitpos: [1:0]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT3    0x00000003U
#define PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT3_M  (PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT3_V << PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT3_S)
#define PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT3_V  0x00000003U
#define PVT_MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT3_S  0
/** PVT_DELAY_OVF_VT1_PD_SITE3_UNIT3 : RO; bitpos: [15]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_OVF_VT1_PD_SITE3_UNIT3    (BIT(15))
#define PVT_DELAY_OVF_VT1_PD_SITE3_UNIT3_M  (PVT_DELAY_OVF_VT1_PD_SITE3_UNIT3_V << PVT_DELAY_OVF_VT1_PD_SITE3_UNIT3_S)
#define PVT_DELAY_OVF_VT1_PD_SITE3_UNIT3_V  0x00000001U
#define PVT_DELAY_OVF_VT1_PD_SITE3_UNIT3_S  15
/** PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT3 : RO; bitpos: [31:16]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT3    0x0000FFFFU
#define PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT3_M  (PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT3_V << PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT3_S)
#define PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT3_V  0x0000FFFFU
#define PVT_TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT3_S  16

/** PVT_COMB_PD_SITE3_UNIT0_VT2_CONF2_REG register
 *  needs desc
 */
#define PVT_COMB_PD_SITE3_UNIT0_VT2_CONF2_REG (DR_REG_PVT_BASE + 0x1d8)
/** PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT0 : R/W; bitpos: [1:0]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT0    0x00000003U
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT0_M  (PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT0_V << PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT0_S)
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT0_V  0x00000003U
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT0_S  0
/** PVT_DELAY_OVF_VT2_PD_SITE3_UNIT0 : RO; bitpos: [15]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT0    (BIT(15))
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT0_M  (PVT_DELAY_OVF_VT2_PD_SITE3_UNIT0_V << PVT_DELAY_OVF_VT2_PD_SITE3_UNIT0_S)
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT0_V  0x00000001U
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT0_S  15
/** PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT0 : RO; bitpos: [31:16]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT0    0x0000FFFFU
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT0_M  (PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT0_V << PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT0_S)
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT0_V  0x0000FFFFU
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT0_S  16

/** PVT_COMB_PD_SITE3_UNIT1_VT2_CONF2_REG register
 *  needs desc
 */
#define PVT_COMB_PD_SITE3_UNIT1_VT2_CONF2_REG (DR_REG_PVT_BASE + 0x1dc)
/** PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT1 : R/W; bitpos: [1:0]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT1    0x00000003U
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT1_M  (PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT1_V << PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT1_S)
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT1_V  0x00000003U
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT1_S  0
/** PVT_DELAY_OVF_VT2_PD_SITE3_UNIT1 : RO; bitpos: [15]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT1    (BIT(15))
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT1_M  (PVT_DELAY_OVF_VT2_PD_SITE3_UNIT1_V << PVT_DELAY_OVF_VT2_PD_SITE3_UNIT1_S)
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT1_V  0x00000001U
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT1_S  15
/** PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT1 : RO; bitpos: [31:16]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT1    0x0000FFFFU
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT1_M  (PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT1_V << PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT1_S)
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT1_V  0x0000FFFFU
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT1_S  16

/** PVT_COMB_PD_SITE3_UNIT2_VT2_CONF2_REG register
 *  needs desc
 */
#define PVT_COMB_PD_SITE3_UNIT2_VT2_CONF2_REG (DR_REG_PVT_BASE + 0x1e0)
/** PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT2 : R/W; bitpos: [1:0]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT2    0x00000003U
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT2_M  (PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT2_V << PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT2_S)
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT2_V  0x00000003U
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT2_S  0
/** PVT_DELAY_OVF_VT2_PD_SITE3_UNIT2 : RO; bitpos: [15]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT2    (BIT(15))
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT2_M  (PVT_DELAY_OVF_VT2_PD_SITE3_UNIT2_V << PVT_DELAY_OVF_VT2_PD_SITE3_UNIT2_S)
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT2_V  0x00000001U
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT2_S  15
/** PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT2 : RO; bitpos: [31:16]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT2    0x0000FFFFU
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT2_M  (PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT2_V << PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT2_S)
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT2_V  0x0000FFFFU
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT2_S  16

/** PVT_COMB_PD_SITE3_UNIT3_VT2_CONF2_REG register
 *  needs desc
 */
#define PVT_COMB_PD_SITE3_UNIT3_VT2_CONF2_REG (DR_REG_PVT_BASE + 0x1e4)
/** PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT3 : R/W; bitpos: [1:0]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT3    0x00000003U
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT3_M  (PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT3_V << PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT3_S)
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT3_V  0x00000003U
#define PVT_MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT3_S  0
/** PVT_DELAY_OVF_VT2_PD_SITE3_UNIT3 : RO; bitpos: [15]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT3    (BIT(15))
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT3_M  (PVT_DELAY_OVF_VT2_PD_SITE3_UNIT3_V << PVT_DELAY_OVF_VT2_PD_SITE3_UNIT3_S)
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT3_V  0x00000001U
#define PVT_DELAY_OVF_VT2_PD_SITE3_UNIT3_S  15
/** PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT3 : RO; bitpos: [31:16]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT3    0x0000FFFFU
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT3_M  (PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT3_V << PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT3_S)
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT3_V  0x0000FFFFU
#define PVT_TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT3_S  16

/** PVT_VALUE_UPDATE_REG register
 *  needs field desc
 */
#define PVT_VALUE_UPDATE_REG (DR_REG_PVT_BASE + 0x1e8)
/** PVT_VALUE_UPDATE : WT; bitpos: [0]; default: 0;
 *  needs field desc
 */
#define PVT_VALUE_UPDATE    (BIT(0))
#define PVT_VALUE_UPDATE_M  (PVT_VALUE_UPDATE_V << PVT_VALUE_UPDATE_S)
#define PVT_VALUE_UPDATE_V  0x00000001U
#define PVT_VALUE_UPDATE_S  0
/** PVT_VALUE_UPDATE_BYPASS : R/W; bitpos: [1]; default: 0;
 *  needs field desc
 */
#define PVT_VALUE_UPDATE_BYPASS    (BIT(1))
#define PVT_VALUE_UPDATE_BYPASS_M  (PVT_VALUE_UPDATE_BYPASS_V << PVT_VALUE_UPDATE_BYPASS_S)
#define PVT_VALUE_UPDATE_BYPASS_V  0x00000001U
#define PVT_VALUE_UPDATE_BYPASS_S  1

/** PVT_DATE_REG register
 *  version register
 */
#define PVT_DATE_REG (DR_REG_PVT_BASE + 0xffc)
/** PVT_DATE : R/W; bitpos: [31:0]; default: 34677040;
 *  version register
 */
#define PVT_DATE    0xFFFFFFFFU
#define PVT_DATE_M  (PVT_DATE_V << PVT_DATE_S)
#define PVT_DATE_V  0xFFFFFFFFU
#define PVT_DATE_S  0

#ifdef __cplusplus
}
#endif
